spec/support/vcr_cassettes/preneeds/pre_need_applications/creates_a_pre_need_application.yml

---
http_interactions:
- request:
    method: post
    uri: "<PRENEEDS_HOST>/eoas_SOA/PreNeedApplicationPort"
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://service.soa.eoas.cem.va.gov/"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><tns:receivePreNeedApplication><preNeedRequest><applicant><applicantEmail>hg@hotmail.com</applicantEmail><applicantPhoneNumber>555-555-5555
        - 234</applicantPhoneNumber><applicantRelationshipToClaimant>Self</applicantRelationshipToClaimant><completingReason>I
        don&#39;t know</completingReason><mailingAddress><address1>1 West 51st Street</address1><city>NY</city><countryCode>US</countryCode><postalZip>10000</postalZip><state>NY</state></mailingAddress><name><firstName>first_name1</firstName><lastName>last_name1</lastName></name></applicant><applicationStatus></applicationStatus><claimant><address><address1>2
        West 51st Street</address1><city>NY</city><countryCode>US</countryCode><postalZip>10000</postalZip><state>NY</state></address><dateOfBirth>2001-01-31</dateOfBirth><desiredCemetery>400</desiredCemetery><name><firstName>first_name2</firstName><lastName>last_name2</lastName></name><relationshipToVet>1</relationshipToVet><ssn>123-45-6789</ssn></claimant><currentlyBuriedPersons><cemeteryNumber>400</cemeteryNumber><name><firstName>first_name3</firstName><lastName>last_name3</lastName></name></currentlyBuriedPersons><hasAttachments>false</hasAttachments><hasCurrentlyBuried>1</hasCurrentlyBuried><sendingApplication>vets.gov</sendingApplication><sendingCode></sendingCode><sentTime>2017-06-29T03:13:52Z</sentTime><trackingNumber>8d6ZZlJxLxeHIlOCtoVG</trackingNumber><veteran><address><address1>3
        West 51st Street</address1><city>NY</city><countryCode>US</countryCode><postalZip>10000</postalZip><state>NY</state></address><currentName><firstName>first_name4</firstName><lastName>last_name4</lastName></currentName><gender>Male</gender><isDeceased>unsure</isDeceased><maritalStatus>Married</maritalStatus><militaryServiceNumber>123456789</militaryServiceNumber><serviceName><firstName>first_name5</firstName><lastName>last_name5</lastName></serviceName><serviceRecords><branchOfService>AF</branchOfService><dischargeType>1</dischargeType></serviceRecords><ssn>123-45-6789</ssn><vaClaimNumber>123456789</vaClaimNumber><militaryStatus>A</militaryStatus></veteran></preNeedRequest></tns:receivePreNeedApplication></env:Body></env:Envelope>
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - text/xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Date:
      - Thu, 29 Jun 2017 03:13:52 GMT
      Content-Length:
      - '2410'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 29 Jun 2017 03:13:53 GMT
      Transfer-Encoding:
      - chunked
      Content-Type:
      - multipart/related;start="<rootpart*71e3a86a-249a-4b9b-9d3c-2b2d83388c6a@example.jaxws.sun.com>";type="application/xop+xml";boundary="uuid:71e3a86a-249a-4b9b-9d3c-2b2d83388c6a";start-info="text/xml"
    body:
      encoding: UTF-8
      string: "--uuid:71e3a86a-249a-4b9b-9d3c-2b2d83388c6a\r\nContent-Id: <rootpart*71e3a86a-249a-4b9b-9d3c-2b2d83388c6a@example.jaxws.sun.com>\r\nContent-Type:
        application/xop+xml;charset=utf-8;type=\"text/xml\"\r\nContent-Transfer-Encoding:
        binary\r\n\r\n<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\"><S:Body><ns2:receivePreNeedApplicationResponse
        xmlns:ns2=\"http://service.soa.eoas.cem.va.gov/\"><return><applicationUUID>f09c3ff2-c047-49f7-b2f5-bc6a2e5b88a9</applicationUUID><returnCode>200</returnCode><returnDescription>PreNeed
        Application received.</returnDescription></return></ns2:receivePreNeedApplicationResponse></S:Body></S:Envelope>\r\n--uuid:71e3a86a-249a-4b9b-9d3c-2b2d83388c6a--"
    http_version: 
  recorded_at: Thu, 29 Jun 2017 03:13:53 GMT
recorded_with: VCR 3.0.3
